xml/request/15.get_object_relations.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <ns1:getObjectRequest>
      <ns1:agency>100200</ns1:agency>
      <ns1:profile>test</ns1:profile>
      <ns1:identifier>100200:27953433</ns1:identifier>
      <ns1:objectFormat>dkabm</ns1:objectFormat>
      <ns1:allRelations>true</ns1:allRelations>
      <ns1:relationData>full</ns1:relationData>
    </ns1:getObjectRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
