tests/requests/example/search_raw_repo_not_my_record.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://oss.dbc.dk/ns/opensearch">
  <SOAP-ENV:Body>
    <ns1:searchRequest>
      <ns1:query>marc.001b=820010</ns1:query>
      <ns1:agency>761500</ns1:agency>
      <ns1:profile>opac</ns1:profile>
      <ns1:repository>rrepo</ns1:repository>
      <ns1:start>1</ns1:start>
      <ns1:stepValue>1</ns1:stepValue>
    </ns1:searchRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
